app/controllers/languages_controller.rb

SELECT * FROM "languages" WHERE ("languages"."id" = 1)
---
  def show
    @language = Language.find(params[:id])

SELECT * FROM "languages" WHERE ("languages"."id" = 1)
---
  def edit
    @language = Language.find(params[:id])

INSERT INTO "languages" ("created_at", "code", "updated_at", "description") VALUES('2008-12-25 14:51:50', 'en_US', '2008-12-25 14:51:50', 'English - United States')
---
  def create
    @language = Language.new(params[:language])

    respond_to do |format|
      if @language.save