app/controllers/phrases_controller.rb

SELECT * FROM "phrases"
---
  def index
    #@phrases = Phrase.find(:all, :order => 'LOWER(phrase) ASC')

    @phrases = Phrase.paginate :page => params[:page], :per_page => 10, :order => 'LOWER(phrase) ASC'

SELECT * FROM "phrases" WHERE ("phrases"."id" = 1)
---
  def show
    @phrase = Phrase.find(params[:id])

SELECT * FROM "languages" WHERE ("languages"."id" = 1)
---
  def new
    @phrase = Phrase.new
    @languages = Language.find(:all)

SELECT * FROM "phrases" WHERE ("phrases"."id" = 1)
---
  def edit
    @phrase = Phrase.find(params[:id])

INSERT INTO "phrases" ("created_at", "phrase", "updated_at", "language_id") VALUES('2008-12-26 10:05:14', 'Home', '2008-12-26 10:05:14', 1)
---
  def create
    @phrase = Phrase.find(:first, :conditions => {:phrase => params[:phrase][:phrase]})

    if @phrase.nil?
      @phrase = Phrase.new(params[:phrase])
    end

    offset = Phrase.count :conditions => ["LOWER(phrase) < ?", @phrase.phrase.downcase]

    per_page = 10

    page = (offset / per_page) + 1



    respond_to do |format|
      if @phrase.save