app/controllers/translations_controller.rb

  def show
    @translation = Translation.find(params[:id])
---
SELECT * FROM "translations" WHERE ("translations"."id" = 1)

  def edit
    @translation = Translation.find(params[:id])
---
SELECT * FROM "translations" WHERE ("translations"."id" = 5)

  def create
    @translation = Translation.new(params[:translation])

    respond_to do |format|
      if @translation.save
---
INSERT INTO "translations" ("created_at", "phrase_id", "updated_at", "translation", "language_id") VALUES('2008-12-26 10:58:15', 1, '2008-12-26 10:58:15', 'ホーム', 2)

  def destroy
    @translation = Translation.find(params[:id])
    @translation.destroy
---
SELECT * FROM "translations" WHERE ("translations"."id" = 2)
DELETE FROM "translations" WHERE "id" = 2