app/controllers/xliff_controller.rb

SELECT * FROM "languages" WHERE ("languages"."id" = 1)
---
  def download
    @language = Language.find(params[:id])